[
  {
    "id": 1,
    "name": "Four Reasons You should invest in Abuja Real",
    "date": "23 Sept, 2024",
    "desc": "1. Abuja has a stable economy and is considered a safe haven for investors looking for return on investment.\n2. Abuja is becoming a popular tourist destination. The demand for hotels, shortlets have increased.\n3. Development of New Residential Areas. The City is expanding and new residential areas are being developed, creating more opportunities for investors.\n4. Potential for Capital Appreciation. Real Estate Investments provide the potential for Capital gains.",
    "image": "./assets/images/pages/home/estate2.jpg"
  },
  {
    "id": 4,
    "name": "How to conduct a search for genuine land in Abuja Using AGIS",
    "date": "12 Oct, 2024",
    "desc": "Guide to Land acquisition in FCT Abuja\n\nLand acquisition in Abuja, FCT, Nigeria, could be tedious especially when one is not a residence or when one is ignorance of the process. One can own a plot of land by direct allocation either from any of the six area councils or directly from the administration of the Federal Capital Development Authority (FCDA). Alternatively, one could also acquire land by buying from a person who has been previously allocated by either the FCT or any of the area councils, or some one who has bought from a direct allotee.\n\nThe simplest way of land acquisition in the FCT is through purchase, where an individual or corporate body wants a piece of land for whatever purpose, and at a certain size and location, has the money to pay for it.\n\nThese tips will certainly assist a prospective buyer; if strictly adhere to make a good buy.\n\n1. The first mistake a prospective buyer could make when looking for a suitable plot of land is to entrust the process on a friend, relative or well wishers, who knows little to nothing about the FCT land matters. Abuja is one of the fastest growing cities in the world today. Therefore, land acquisition is one of the most lucrative businesses in the capital city and must be handled efficiently to achieve the best result. There are lots of land agents who could help source for and get the desire land documents which could meet the needs of the buyer without the influence of a friend, relative or brother who knows nothing about the business. Therefore, the services of a honest land agent or a land surveyor is very imperatives in acquiring a landed property in the FCT.\n\n2. When the documents of the land in view are found, it is very important for the buyer to conduct a proper search for the documents. Search for land documents are done either in the area council that issued the offer letter of allocation, if the land is a customary land i.e Abuja Municipal Area Council, Abaji Area Council, Bwari Area Council, Gwagwalada Area Council, Kuje Area Council or Kwali Area Council. Search for federal land are hitherto conducted in the FCDA but now moved to the Abuja Geographic Information System (AGIS), the agency of the Federal Capital Development Authority (FCDA) on land matters. It is important to know that when a land search is being conducted, a certain receipted fee should be paid to the searching authority, and the result of the search formally given to the person conducting the search. This is important to establish the genuine of the names on either the offer letter of allocation or the certificate of occupancy(C of O) offered for sale. Again, either a lawyer or a land surveyor of repute could best conduct search for land document. Search for a land that is already certificated is easier than a land that has not been processed, as in offer letter of allocation, because a genuine certificated plot may not have encumbrances of location problems. However, a letter of offer of allocation may be difficult to locate, considering the fact that the data and other coordinates that may assist the location process may not be available at the time of purchase. Therefore, it is important to engage a professional land surveyor to conduct search on the availability of the land in view before purchase. A land surveyor will be able to determine the location of the plot and if need be, establish the beacons and the coordinates.\n\n3. In the case of land that is already certificated, the Technical Deeds Plan (TDP) embedded in the certificate of occupancy will give the coordinate properties that will indicate to the buyer the actual size, position, access, and the adjoining plots, since the TDP is the actual representation of the plot on land in paper. Therefore, a buyer must recognise the important of the TDP or is it the Right of Occupancy (R 0f O) as it is known in the local parlance. A prospective buyer must do a good search on this part of the land document to achieve a good buy.\n\n4. The Deeds of Assignment or Conveyance. This is the trace of history of the land transfers of ownership till date. The conveyance gives information about the true owners of the land from A to B to C. It is important that a buyer must conduct a proper search on this document to establish the true owner of the land before payment is made. An agent could deceive a buyer by presenting a fake owner to assume the identity of the original owner, may tell the buyer that the real owner is fictitious, or may out rightly coerce the buyer to buy instantly without conducting a proper search on this aspect. Buyer must engage the services of a property lawyer to do a thorough search of the conveyance before entering into payment arrangement; otherwise, a buyer's money may go down the drain while the land will remain where it was.\n\nIn conclusion, buyers must endeavour to go through all the procedures above to safeguard his/her money to avoid losing it, after all, as I said earlier, it is your money that will go down the drain while the land remains where it was.",
    "image": "./assets/images/pages/home/estate1.jpg"
  },
  {
    "id": 5,
    "name": "Land Banking for investors in Abuja",
    "date": "12 Oct, 2024",
    "desc": "What is Land Banking?\n\nLand Banking is simply using your money to invest landed property at a cheap rate, then selling for a higher return on investment over period of time. It is important that you understand land Banking isn't a get rich quick scheme.\n\nSome factors to consider when purchasing land for land Banking:\n\n1. Commerce - commerce involves the economic activities of buying and selling.\n2. Opportunities - The Current and the projected opportunities in the environment.\n3. Migration - Where the population is going, that's where you should buy land.\n4. Population - The growing population of the environment.\n5. Employment\n6. Lifestyle",
    "image": "./assets/images/pages/home/estate3.jpg"
  },
  {
    "id": 6,
    "name": "Abuja land or houses",
    "date": "12 Oct, 2024",
    "desc": "Depending on the individual, the purpose and the capital at hand. Neither is a bad investment. It depends on the purpose of the purchase is it for investment or residential. Find out your why.",
    "image": "./assets/images/pages/home/estate4.jpeg"
  },
  {
    "id": 7,
    "name": "How Not be scammed in the real estate market in Abuja",
    "date": "12 Oct, 2024",
    "desc": "Here are a few Reasons why people are scammed in the Abuja Real Estate Market.\n\n1. Not doing the proper due diligence - Check our blog Post on how to verify your land on Agis.\n2. Not having the right documents after purchase.\n3. Not knowing the kind of structure you can build on the land\n4. Not knowing the purpose whether it's commercial or residential.\n5. Buying from village chiefs.\n6. Not Buying from credible Real Estate Companies like Bardi Real Estate Limited.",
    "image": "./assets/images/pages/home/estate5.jpeg"
  },
  {
    "id": 8,
    "name": "Why you should own Real Estate in Abuja Part One",
    "date": "12 Oct, 2024",
    "desc": "1. Real Estate is a tangible investment compared to intangible assets like stocks and bonds.\n2. Real Estate usually appreciates over the years the cost of landed property has steadily increased from 1960 till date.\n3. Real Estate can provide three kinds of cash flow leverage cashflow, lifestyle cash flow and legacy cashflow.\n4. You don't need Alot of money to start investing in real estate you can start small.",
    "image": "./assets/images/pages/home/estate6.jpeg"
  },
  {
    "id": 9,
    "name": "Reasons You should own Real Estate in Abuja Part 2",
    "date": "12 Oct, 2024",
    "desc": "1. Diversification of investment portfolio.\n2. Leverage - Real Estate can be used as leverage to acquire funds\n3. Control - Authority over investments decisions, you can decide what it's used for.\n4. Inflation Rate. Real Estate protects you against inflation.\n5. Rapid infrastructural development",
    "image": "./assets/images/pages/home/estate8.jpeg"
  },
  {
    "id": 10,
    "name": "Real Estate Investments you can do in Abuja",
    "date": "12 Oct, 2024",
    "desc": "1. Land Banking.\n2. Rental Property Residential.\n3. Rental Property commercial.\n4. Service Apartments\n5. Commercial property development.\n6. Estate Development",
    "image": "./assets/images/pages/home/estate7.jpeg"
  },
  {
    "id": 11,
    "name": "The difference between service plots and investment Plots",
    "date": "12 Oct, 2024",
    "desc": "What are investment plots???\n\nInvestment plots are simply lands bought at strategic locations where the values are expected to appreciate overtime between 1-1O years.\n\nDue to different factors such as development of infrastructures, commercial activities, private etc\n\nInvestment plots are basically for futuristic plans and not for immediate development.\n\nThe people who enjoy today are those who made investments yesterday and for you to enjoy tomorrow try and make reasonable investments today\n\nNote: Investment Plots are not usually for immediate gain\n\nService Plots- this are plots for immediate development. They are the buy and build plots. Most of the times they are residential.",
    "image": "./assets/images/pages/home/estate10.jpeg"
  }
]
